using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp5
{
    class Program
    {
        /*
         Необходимо реализовать иерархию цветов (розы, гвоздики, тюльпаны). Создать несколько объектов-цветов. 
         Собрать букет с определением его стоимости. В букет может входить несколько цветов одного типа.

        в принципе стандартный CRUD. Для разнообразия можно хранить в файле (save/load). 
        Все товары должны наследовать абстрактный класс с базовым набором полей (имя, цена, и т.д.) 
        + кастомный интерфейс (напр. сборка, разборка или что-то в этом духе).
             */
        static void Main(string[] args)
        {
        }
    }
}
